<?php
# 연관배열로 메뉴를 만들면?
# $menu = ['치즈김밥' => 3800, '라면' => 4100, '칼국수' => 5500, '돈까스' => 7200];

$menu = ['치즈김밥', '라면', '칼국수', '돈까스'];
$price = array(3800, 4100, 5500, 7200);

# 이건 배열 오더말고 따로따로 쓴거야
$m0 = $_GET['m0'];
$m1 = $_GET['m1'];
$m2 = $_GET['m2'];
$m3 = $_GET['m3'];

$order = [$m0, $m1, $m2, $m3];
var_dump($order);
# 배열 오더를 활용해서 밑에 if문처럼 쓴거 말고 반복문으로 출력해보기

# 오더리스트 보여주기, 마지막엔 총 금액까지
echo "<h2>Order List</h2>";
if($m0 > 0) echo "$menu[0] : $m0 = ". ($m0 * $price[0]). "원<br>";
if($m1 > 1) echo "$menu[1] : $m1 = ". ($m1 * $price[0]). "원<br>";
if($m2 > 0) echo "$menu[2] : $m2 = ". ($m2 * $price[0]). "원<br>";
if($m3 > 0) echo "$menu[3] : $m3 = ". ($m3 * $price[0]). "원<br>";
# if($m0 > 0) 이라면 주문했다는 의미
?>