<?php
# 영어 단어들을 연관배열로 정의. (20개)
$voca = ['conceit'=>['자만','자부심'], 'capable'=>['할 수 있는','능력있는','가능한'], 'durable'=>['내구력이 있는','튼튼한'],
         'usher'=>['안내하다'], 'fabricate'=>['위조하다','조립하다'], 'accidently'=>['우연히'], 'revenue'=>['매출','세입','수익'], 
         'sovereignty'=>['주권','영유권','통치권'], 'except for'=>['제외하고','~이 없으면'], 'prosperous'=>['번영하는','성공한'],
         'nominate'=>['지명하다','추천하다'], 'verify'=>['검증하다','확인하다','증명하다'], 'further'=>['더 나아가','그 이상의', '게다가'],
         'authentic'=>['진정한','진짜의','믿을 만한'], 'antibiotic'=>['항생제','항균'],'commemorate'=>['기념하다','행사','기리다'],
         'persist'=>['지속하다','고집하다'], 'apprehensive'=>['불안한','걱정되는','신경쓰이는'], 'carriage'=>['운송','마차','객차'],
         'catch a cold'=>['감기 들다','감기 걸리다']];
?>